In [18]:
import pandas as pd
import numpy as np
import seaborn as sns

In [33]:
data = { 'price' : [1000,2000,3000,3500,4000],
      'vehicle' : ["cycle","bike","car","suv","truck"]
     }

In [34]:
df = pd.DataFrame(data,columns = ['price','vehicle'])

In [35]:
print(df)

   price vehicle
0   1000   cycle
1   2000    bike
2   3000     car
3   3500     suv
4   4000   truck

In [41]:
df2 = df.to_excel("C:/Users/Vinayak BB/Desktop/demo.xlsx")

df2

In [44]:
df3 = pd.read_excel("C:/Users/Vinayak BB/Desktop/demo.xlsx")

In [109]:
df3

   Unnamed: 0  price vehicle
0           0   1000   cycle
1           1   2000    bike
2           2   3000     car
3           3   3500     suv
4           4   4000   truck

In [149]:
df4_flip=df3.T

In [150]:
print(df4_flip)

                0     1     2     3      4
Unnamed: 0      0     1     2     3      4
price        1000  2000  3000  3500   4000
vehicle     cycle  bike   car   suv  truck

In [151]:
df4_flip = df4_flip.rename(columns={df4_flip.columns[0]:"00"})

In [152]:
df4_flip

               00     1     2     3      4
Unnamed: 0      0     1     2     3      4
price        1000  2000  3000  3500   4000
vehicle     cycle  bike   car   suv  truck

In [153]:
df = df.rename(columns = {df.columns[1]:"vehicle"})

In [154]:
df4_flip = df4_flip.T

In [155]:
df4_flip

   Unnamed: 0 price vehicle
00          0  1000   cycle
1           1  2000    bike
2           2  3000     car
3           3  3500     suv
4           4  4000   truck

In [156]:
df4_flip = df4_flip.rename(columns = {df4_flip.columns[0]:"Dicount"})

In [157]:
df4_flip["final discount"] = df4_flip["price"] * 0.75

In [158]:
print(df4_flip)

   Dicount price vehicle final discount
00       0  1000   cycle            750
1        1  2000    bike           1500
2        2  3000     car           2250
3        3  3500     suv           2625
4        4  4000   truck           3000

In [161]:
print(df4_flip)

   Dicount price vehicle final discount
00       0  1000   cycle            750
1        1  2000    bike           1500
2        2  3000     car           2250
3        3  3500     suv           2625
4        4  4000   truck           3000

In [194]:
df6 = df4_flip

In [195]:
print(df6)

   Dicount price vehicle final discount
00       0  1000   cycle            750
1        1  2000    bike           1500
2        2  3000     car           2250
3        3  3500     suv           2625
4        4  4000   truck           3000

In [192]:
df6 = df6.to_csv("C:/Users/Vinayak BB/Desktop/demo3.csv")

In [196]:
df6 = df6.to_excel("C:/Users/Vinayak BB/Desktop/demo4.xlsx")

In [197]:
df6